In [2]:
import pandas as pd
import numpy as np

In [4]:
a = np.random.randint(10,size=6)
b = np.random.randint(10,size=6)
c = np.random.randint(10,size=6)

In [5]:
data=pd.DataFrame({"s1":a,"s2":b,"s3":c})

In [6]:
data

   s1  s2  s3
0   0   2   0
1   0   8   7
2   2   4   1
3   5   0   6
4   5   8   4
5   4   1   9

In [7]:
data[0:1] #0'dan başla 1'inci indekse kadar olan satırı getir.(1.indeksi getirmez.)

   s1  s2  s3
0   0   2   0

In [8]:
data[0:2] #0'dan başla 2'inci indekse kadar olan satırı getir.(2.indeksi getirmez.)

   s1  s2  s3
0   0   2   0
1   0   8   7

In [15]:
data[1:4]

   s1  s2  s3
1   0   8   7
2   2   4   1
3   5   0   6

In [16]:
data.index=(10,20,30,40,50,60)

In [17]:
data

    s1  s2  s3
10   0   2   0
20   0   8   7
30   2   4   1
40   5   0   6
50   5   8   4
60   4   1   9

In [18]:
data.loc[20] #gerçek olmayan indekse göre 20. indeksi çağırdım.

s1    0
s2    8
s3    7
Name: 20, dtype: int32

In [19]:
data.iloc[1] #gerçek indekse göre 1.indeksi çağırdım.

s1    0
s2    8
s3    7
Name: 20, dtype: int32